IRP/src/AccumulationRegisters/R8014T_ConsignorSales/R8014T_ConsignorSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R8014T_ConsignorSales</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>NetAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>DELETE_RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SalesInvoice</name>
  <type>
   <types>DocumentRef.RetailSalesReceipt</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_PurchaseInvoice</name>
  <type>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.OpeningEntry</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_DontCalculateRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_ConsignorPrice</name>
  <type>
   <types>DefinedType.typePrice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Price</name>
  <type>
   <types>DefinedType.typePrice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/TradeAgentFeeTypes/TradeAgentFeeTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>TradeAgentFeeTypes</name>
 <enumValues>
  <name>Percent</name>
 </enumValues>
 <enumValues>
  <name>DifferencePriceConsignorPrice</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/SerialLotNumbers/SerialLotNumbers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>SerialLotNumbers</name>
 <attributes>
  <name>SerialLotNumberOwner</name>
  <type>
   <types>CatalogRef.Items</types>
   <types>CatalogRef.ItemKeys</types>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Inactive</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EachSerialLotNumberIsUnique</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CodeString</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>HasRelatedSerialLotNumbers</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RelatedSerialLotNumbers</name>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocSalesReportToConsignorServer/Module.bsl
#Region FORM

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	If Form.Parameters.Key.IsEmpty() Then
		SetGroupItemsList(Object, Form);
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	ViewServer_V2.OnCreateAtServer(Object, Form, "ItemList");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
	LockDataModificationPrivileged.LockFormIfObjectIsLocked(Form, CurrentObject);
EndProcedure

#EndRegion

#Region _TITLE

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array();
	AttributesArray.Add("Company");
	AttributesArray.Add("Partner");
	AttributesArray.Add("LegalName");
	AttributesArray.Add("Agreement");
	AttributesArray.Add("LegalNameContract");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Attr In AttributesArray Do
		Form.GroupItems.Add(Attr, ?(ValueIsFilled(Form.Items[Attr].Title), Form.Items[Attr].Title,
			Object.Ref.Metadata().Attributes[Attr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion

#Region LIST_FORM

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region CHOICE_FORM

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

Function GetConsignorSales(Parameters) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	ConsignorSales.ItemKey.Item AS Item,
	|	ConsignorSales.ItemKey,
	|	ConsignorSales.Unit,
	|	ConsignorSales.PriceType,
	|	ConsignorSales.ConsignorPrice,
	|	ConsignorSales.Price,
	|	ConsignorSales.QuantityTurnover AS Quantity,
	|	ConsignorSales.NetAmountTurnover AS NetAmount,
	|	ConsignorSales.AmountTurnover AS TotalAmount,
	|	ConsignorSales.SalesInvoice,
	|	ConsignorSales.PurchaseInvoice,
	|	VALUE(Catalog.SerialLotNumbers.EmptyRef) AS SerialLotNumber,
	|	0 AS SumColumn,
	|	TRUE AS Use,
	|	CASE
	|		WHEN ConsignorSales.Agreement.TradeAgentFeeType = VALUE(Enum.TradeAgentFeeTypes.Percent)
	|			then ConsignorSales.Agreement.TradeAgentFeePercent
	|		ELSE 0
	|	END AS TradeAgentFeePercent
	|FROM
	|	AccumulationRegister.R8014T_ConsignorSales.Turnovers(BEGINOFPERIOD(&StartDate, DAY), ENDOFPERIOD(&EndDate, DAY),,
	|		Company = &Company
	|	AND Partner = &Partner
	|	AND Agreement = &Agreement
	|	AND PriceIncludeTax = &PriceIncludeTax
	|	AND CurrencyMovementType = &CurrencyMovementType) AS ConsignorSales
	|WHERE
	|	ConsignorSales.QuantityTurnover <> 0";
	Query.SetParameter("StartDate"       , Parameters.StartDate);
	Query.SetParameter("EndDate"         , Parameters.EndDate);
	Query.SetParameter("Company"         , Parameters.Company);
	Query.SetParameter("Partner"         , Parameters.Partner);
	Query.SetParameter("Agreement"       , Parameters.Agreement);
	Query.SetParameter("PriceIncludeTax" , Parameters.PriceIncludeTax);
	Query.SetParameter("CurrencyMovementType" , Parameters.Agreement.CurrencyMovementType);
	
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction
